### 1) Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [1]:
import pandas as pd
import numpy as np

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
    
print()
print("Creating the DtaFrame from Dictionary")
print()


exam_df=pd.DataFrame(exam_data,index=labels)
print(exam_df)

Creating the DtaFrame from Dictionary

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

### Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.

In [2]:
basic_info=exam_df.info()
print(basic_info)

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

In [3]:
exam_desc=exam_df.describe()
print(exam_desc)

           score   attempts
count   8.000000  10.000000
mean   13.562500   1.900000
std     4.693746   0.875595
min     8.000000   1.000000
25%     9.000000   1.000000
50%    13.500000   2.000000
75%    17.125000   2.750000
max    20.000000   3.000000

In [4]:
### Counting the datatype in DataFrame.
exam_df.dtypes.value_counts()

object     2
int64      1
float64    1
dtype: int64

In [5]:
exam_df.select_dtypes(include='integer')

   attempts
a         1
b         3
c         2
d         3
e         2
f         3
g         1
h         1
i         2
j         1

### Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [6]:
result=exam_df[['name','score']]
print(result)

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

### Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [7]:
result=exam_df[exam_df['attempts']>1]
print(result)

        name  score  attempts qualify
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
i      Kevin    8.0         2      no

### Write a Pandas program to count the number of rows and columns of a DataFrame.

In [8]:
number_rows=len(exam_df.axes[0])
number_columns=len(exam_df.axes[1])
print(number_rows)
print(number_columns)

10
4

### Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [9]:
nan_values=exam_df[exam_df['score'].isnull()]
print(nan_values)

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

### Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [10]:
values=exam_df[exam_df['score'].between(15,20)]
print(values)

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

### Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [11]:
result=exam_df[(exam_df['attempts']<3 )&(exam_df['score']>15)]
print(result)

        name  score  attempts qualify
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes

### Write a Pandas program to calculate the sum of the examination attempts by the students.

In [12]:
sum_attempts=exam_df['attempts'].sum()
print(sum_attempts)

19

In [13]:
sum_score=exam_df['score'].sum()
print(sum_score)

108.5

In [14]:
### Calculating mean of score.
mean_score=exam_df['score'].mean()
print(mean_score)

13.5625

### Write a Pandas program to append a new row 'k' to DataFrame with given values for each column. Now delete the new row and return the original data frame.

In [15]:
exam_df.loc['k']=['Hitesh',15.5,3,'yes']
exam_df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Hitesh   15.5         3     yes

In [16]:
### Deleting the new added rows from DataFrame.
result=exam_df.drop('k')
print(result)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

### Write a Pandas program to sort the data frame first by 'name' in descending order, then by 'score' in ascending order.

In [17]:
sort_data=exam_df.sort_values(by=['name','score'],ascending=[False,True])
print(sort_data)

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
k     Hitesh   15.5         3     yes
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

### Write a Pandas program to change the name 'James' to 'Suresh' in name column of the data frame.

In [18]:
exam_df['name']=exam_df['name'].replace('james','Hitesh')
print(exam_df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Hitesh   15.5         3     yes

In [19]:
exam_df['attempts']=exam_df['attempts'].replace(1,4)
print(exam_df)

        name  score  attempts qualify
a  Anastasia   12.5         4     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         4     yes
h      Laura    NaN         4      no
i      Kevin    8.0         2      no
j      Jonas   19.0         4     yes
k     Hitesh   15.5         3     yes

### Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [20]:
exam_df.pop('score')
print(exam_df)

        name  attempts qualify
a  Anastasia         4     yes
b       Dima         3      no
c  Katherine         2     yes
d      James         3      no
e      Emily         2      no
f    Michael         3     yes
g    Matthew         4     yes
h      Laura         4      no
i      Kevin         2      no
j      Jonas         4     yes
k     Hitesh         3     yes

### Adding new column to existing DataFrame in Pandas.

In [21]:
### write a program insert new column in DataFrame.
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red','orange']
print()
exam_df['Color']=color
exam_df

        name  attempts qualify   Color
a  Anastasia         4     yes     Red
b       Dima         3      no    Blue
c  Katherine         2     yes  Orange
d      James         3      no     Red
e      Emily         2      no   White
f    Michael         3     yes   White
g    Matthew         4     yes    Blue
h      Laura         4      no   Green
i      Kevin         2      no   Green
j      Jonas         4     yes     Red
k     Hitesh         3     yes  orange

### Write a Pandas program to iterate over rows in a DataFrame.

In [22]:
exam_df

for index,i in exam_df.iterrows():
    print(i['name'],' ',i['Color'])

Anastasia   Red
Dima   Blue
Katherine   Orange
James   Red
Emily   White
Michael   White
Matthew   Blue
Laura   Green
Kevin   Green
Jonas   Red
Hitesh   orange

In [23]:
exam_df.columns

Index(['name', 'attempts', 'qualify', 'Color'], dtype='object')

### Write a Pandas program to rename columns of a given DataFrame.

In [24]:
exam_df=exam_df.rename(columns={'name':'Name','qualify':'Qualify'})
exam_df

        Name  attempts Qualify   Color
a  Anastasia         4     yes     Red
b       Dima         3      no    Blue
c  Katherine         2     yes  Orange
d      James         3      no     Red
e      Emily         2      no   White
f    Michael         3     yes   White
g    Matthew         4     yes    Blue
h      Laura         4      no   Green
i      Kevin         2      no   Green
j      Jonas         4     yes     Red
k     Hitesh         3     yes  orange

### Write a Pandas program to add one row in an existing DataFrame.

### 1) using the DataFrame.append() function.

In [25]:
exam_df

df1={'Name':'Sonal','attempts':2,'Qualify':'No','Color':'Pink'}
print()
print("Adding new row in DataFrame")
exam_df=exam_df.append(df1,ignore_index=True)
exam_df

Adding new row in DataFrame

         Name  attempts Qualify   Color
0   Anastasia         4     yes     Red
1        Dima         3      no    Blue
2   Katherine         2     yes  Orange
3       James         3      no     Red
4       Emily         2      no   White
5     Michael         3     yes   White
6     Matthew         4     yes    Blue
7       Laura         4      no   Green
8       Kevin         2      no   Green
9       Jonas         4     yes     Red
10     Hitesh         3     yes  orange
11      Sonal         2      No    Pink

### 2) using the pandas.concat().

In [26]:
df2={'Name':['Sannidhya','Prajwal'],
     'attempts':[2,1],
     'Qualify':['Yes','No'],
     'Color':['Blue','Red']}
print()
print("Convert Dictionary into DataFrame")

df_new=pd.DataFrame(df2)
df_new
print()
result=pd.concat([exam_df,df_new],ignore_index=True)
result

Convert Dictionary into DataFrame

         Name  attempts Qualify   Color
0   Anastasia         4     yes     Red
1        Dima         3      no    Blue
2   Katherine         2     yes  Orange
3       James         3      no     Red
4       Emily         2      no   White
5     Michael         3     yes   White
6     Matthew         4     yes    Blue
7       Laura         4      no   Green
8       Kevin         2      no   Green
9       Jonas         4     yes     Red
10     Hitesh         3     yes  orange
11      Sonal         2      No    Pink
12  Sannidhya         2     Yes    Blue
13    Prajwal         1      No     Red

### Adding new Columns By using DataFrame.insert().

In [27]:
# Define a dictionary containing Students data
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Height': [5.1, 6.2, 5.1, 5.2],
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}
print()
print("Converting Dictionary into DataFrame")
data_df=pd.DataFrame(data)
data_df
print()
print("Adding new Column in DataFrame")
data_df.insert(2,'Age',[30,26,28,35],allow_duplicates=False)
data_df

Converting Dictionary into DataFrame

Adding new Column in DataFrame

     Name  Height  Age Qualification
0     Jai     5.1   30           Msc
1  Princi     6.2   26            MA
2  Gaurav     5.1   28           Msc
3    Anuj     5.2   35           Msc

### Adding new Columns Using Dataframe.assign() method.
This method will create a new dataframe with a new column added to the old dataframe.

In [28]:
data_df
# Using 'Address' as the column name and equating it to the list
new_data=data_df.assign(address=['Delhi', 'Bangalore', 'Chennai', 'Patna'])
new_data

     Name  Height  Age Qualification    address
0     Jai     5.1   30           Msc      Delhi
1  Princi     6.2   26            MA  Bangalore
2  Gaurav     5.1   28           Msc    Chennai
3    Anuj     5.2   35           Msc      Patna

### Adding new Columns UsingBy using a dictionary.

In [44]:
new_data

Education={'Jai':'BCom','Princi':'B.E','Gaurav':'Doctor','Anuj':'Lowyer'}

new_data['Education']=Education
new_data

     Name  Height  Age Qualification    address Education
0     Jai     5.1   30           Msc      Delhi       Jai
1  Princi     6.2   26            MA  Bangalore    Princi
2  Gaurav     5.1   28           Msc    Chennai    Gaurav
3    Anuj     5.2   35           Msc      Patna      Anuj

### Create a new column in Pandas DataFrame based on the existing columns.

In [30]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                    'Cost':[10000, 5000, 15000, 2000]})
df

df['Discounted_Price']=df['Cost']-(0.1*df['Cost'])
df

        Date    Event   Cost  Discounted_Price
0  10/2/2011    Music  10000            9000.0
1  11/2/2011   Poetry   5000            4500.0
2  12/2/2011  Theatre  15000           13500.0
3  13/2/2011   Comedy   2000            1800.0

In [31]:
### Finding the maximum values in Cost columns.

print(df[df.Cost==df.Cost.max()])

        Date    Event   Cost  Discounted_Price
2  12/2/2011  Theatre  15000           13500.0

In [32]:
### Finding the maximum values in Discounted_price columns.
print(df[df.Discounted_Price==df.Discounted_Price.max()])

        Date    Event   Cost  Discounted_Price
2  12/2/2011  Theatre  15000           13500.0

In [33]:
### Finding the minimum values in Cost columns.
print(df[df.Cost==df.Cost.min()])

        Date   Event  Cost  Discounted_Price
3  13/2/2011  Comedy  2000            1800.0

In [45]:
### Finding the maximum values in Discounted_price columns.
print(df[df.Discounted_Price==df.Discounted_Price.max()])

        Date    Event   Cost  Discounted_Price
2  12/2/2011  Theatre  15000           13500.0

## How to Sort a Pandas DataFrame based on column names or row index?.

In [35]:
# List of Tuples
students = [('Ankit', 22, 'Up', 'Geu'),
           ('Ankita', 31, 'Delhi', 'Gehu'),
           ('Rahul', 16, 'Tokyo', 'Abes'),
           ('Simran', 41, 'Delhi', 'Gehu'),
           ('Shaurya', 33, 'Delhi', 'Geu'),
           ('Harshita', 35, 'Mumbai', 'Bhu' ),
           ('Swapnil', 35, 'Mp', 'Geu'),
           ('Priya', 35, 'Uk', 'Geu'),
           ('Jeet', 35, 'Guj', 'Gehu'),
           ('Ananya', 35, 'Up', 'Bhu')
            ]

students
print()
print("Converting LIst of Tuples into DataFrame")

stud_df=pd.DataFrame(students,columns=['Name','Age','City','College'],index =[ 'b', 'c', 'a', 'e', 'f','g', 'i', 'j', 'k', 'd'])
stud_df

Converting LIst of Tuples into DataFrame

       Name  Age    City College
b     Ankit   22      Up     Geu
c    Ankita   31   Delhi    Gehu
a     Rahul   16   Tokyo    Abes
e    Simran   41   Delhi    Gehu
f   Shaurya   33   Delhi     Geu
g  Harshita   35  Mumbai     Bhu
i   Swapnil   35      Mp     Geu
j     Priya   35      Uk     Geu
k      Jeet   35     Guj    Gehu
d    Ananya   35      Up     Bhu

###  Sort the rows of dataframe based on row index label names.

In [36]:
stud_sort=stud_df.sort_index()
stud_sort

       Name  Age    City College
a     Rahul   16   Tokyo    Abes
b     Ankit   22      Up     Geu
c    Ankita   31   Delhi    Gehu
d    Ananya   35      Up     Bhu
e    Simran   41   Delhi    Gehu
f   Shaurya   33   Delhi     Geu
g  Harshita   35  Mumbai     Bhu
i   Swapnil   35      Mp     Geu
j     Priya   35      Uk     Geu
k      Jeet   35     Guj    Gehu

### Sort rows of a Dataframe in Descending Order based on Row index labels.

In [37]:
stud_result=stud_df.sort_index(ascending=False)
stud_result

       Name  Age    City College
k      Jeet   35     Guj    Gehu
j     Priya   35      Uk     Geu
i   Swapnil   35      Mp     Geu
g  Harshita   35  Mumbai     Bhu
f   Shaurya   33   Delhi     Geu
e    Simran   41   Delhi    Gehu
d    Ananya   35      Up     Bhu
c    Ankita   31   Delhi    Gehu
b     Ankit   22      Up     Geu
a     Rahul   16   Tokyo    Abes

### Sort rows of a Dataframe based on Row index labels in Place.

In [38]:
stud_df.sort_index(inplace=True)
stud_df

       Name  Age    City College
a     Rahul   16   Tokyo    Abes
b     Ankit   22      Up     Geu
c    Ankita   31   Delhi    Gehu
d    Ananya   35      Up     Bhu
e    Simran   41   Delhi    Gehu
f   Shaurya   33   Delhi     Geu
g  Harshita   35  Mumbai     Bhu
i   Swapnil   35      Mp     Geu
j     Priya   35      Uk     Geu
k      Jeet   35     Guj    Gehu

### Sort Columns of a Dataframe based on Column Names.

In [39]:
sort_column=stud_df.sort_index(axis=1)
sort_column

   Age    City College      Name
a   16   Tokyo    Abes     Rahul
b   22      Up     Geu     Ankit
c   31   Delhi    Gehu    Ankita
d   35      Up     Bhu    Ananya
e   41   Delhi    Gehu    Simran
f   33   Delhi     Geu   Shaurya
g   35  Mumbai     Bhu  Harshita
i   35      Mp     Geu   Swapnil
j   35      Uk     Geu     Priya
k   35     Guj    Gehu      Jeet

### Sort a dataframe in descending order based on column names.

In [40]:
sort_data=stud_df.sort_index(ascending=False,axis=1)
sort_data

       Name College    City  Age
a     Rahul    Abes   Tokyo   16
b     Ankit     Geu      Up   22
c    Ankita    Gehu   Delhi   31
d    Ananya     Bhu      Up   35
e    Simran    Gehu   Delhi   41
f   Shaurya     Geu   Delhi   33
g  Harshita     Bhu  Mumbai   35
i   Swapnil     Geu      Mp   35
j     Priya     Geu      Uk   35
k      Jeet    Gehu     Guj   35

In [41]:
stud_df.sort_values(by='Age',ascending=False)

       Name  Age    City College
e    Simran   41   Delhi    Gehu
d    Ananya   35      Up     Bhu
g  Harshita   35  Mumbai     Bhu
i   Swapnil   35      Mp     Geu
j     Priya   35      Uk     Geu
k      Jeet   35     Guj    Gehu
f   Shaurya   33   Delhi     Geu
c    Ankita   31   Delhi    Gehu
b     Ankit   22      Up     Geu
a     Rahul   16   Tokyo    Abes

### Write a Pandas program to combining two series into a DataFrame.

In [42]:
import pandas as pd
import numpy as np
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['10', '20', 'php', '30.12', '40'])
print()
print(s1)
print()
print(s2)

result=pd.concat([s1,s2],axis=1)
result

0       100
1       200
2    python
3    300.12
4       400
dtype: object

0       10
1       20
2      php
3    30.12
4       40
dtype: object

        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40